driver-tests/encoder/EncoderTests/TestCustomEncoderApp/test/DecodeEncode/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rec="http://j2ee.netbeans.org/wsdl/TestCustomEncoder/ReceiveInput">
  <soapenv:Body>
    <rec:ReceiveInputOperation>
      <rioIn>AAA,BBB|0123456789abcdefghijklmno</rioIn>
    </rec:ReceiveInputOperation>
  </soapenv:Body>
</soapenv:Envelope>